crud/app/views/home/show.html.erb

SELECT "hashtags".* FROM "hashtags" INNER JOIN "hashtags_posts" ON "hashtags"."id" = "hashtags_posts"."hashtag_id" WHERE "hashtags_posts"."post_id" = ?  [["post_id", 71]]
---
<p>
    <% @post.hashtags.each do |h| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 71]]
---
<br/>
<% @post.comments.each do |c| %>