crud/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "3213"], ["post_id", 63], ["created_at", "2020-09-01 10:13:26.300513"], ["updated_at", "2020-09-01 10:13:26.300513"]]
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "2313213"], ["post_id", 63], ["created_at", "2020-09-02 08:04:59.162446"], ["updated_at", "2020-09-02 08:04:59.162446"], ["user_id", 1]]
---
  def create
    comment = Comment.create(comment_params)
    comment.post_id = params[:post_id]
    comment.user_id = current_user.id
    comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Comment.find(params[:id]).destroy