crud/app/controllers/home_controller.rb

    def destroy
        # 아이디을 받아서 그것을 Post내에서 찾는다
        Post.find(params[:post_id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 35]]