crud/app/controllers/home_controller.rb

INSERT INTO "hashtags" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "헤시1"], ["created_at", "2020-09-03 10:29:07.292159"], ["updated_at", "2020-09-03 10:29:07.292159"]]
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."title" = ? LIMIT ?  [["title", "헤시1"], ["LIMIT", 1]]
---
    def create
        post = Post.new(post_params)# 테이블 한 행 추가, 한 행을 만들고(객체), @post라는 변수에 저장
       # post.title = params[:post][:title] # params 객체의 post_title 속성을 title에 저장
       # post.content = params[:post][:content] # params 객체의 post_content 속성을 content에 저장
       3.times do |i|
        hashtags = hashtag_params[:hashtags_attributes][:"#{i}"][:"title"]
        hashtags = Hashtag.find_or_create_by(title: hashtags)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 72]]
---
    def destroy
        # 아이디을 받아서 그것을 Post내에서 찾는다
        #Post.find(params[:id]).destroy
        # 해당 게시물 삭제
        @post.destroy