crud/app/controllers/home_controller.rb

    def create
        post = Post.new # 테이블 한 행 추가, 한 행을 만들고(객체), @post라는 변수에 저장
        post.title = params[:post_title] # params 객체의 post_title 속성을 title에 저장
        post.content = params[:post_content] # params 객체의 post_content 속성을 content에 저장
        post.save # 테이블에 쓴 내용을 저장
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "2132"], ["content", "123213"], ["created_at", "2020-08-26 06:47:54.844450"], ["updated_at", "2020-08-26 06:47:54.844450"]]

    def edit
        @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]

    def update
        # 인스턴스 변수를 사용하는 경우는 view파일에서 사용해야 할 때 사용
        post = Post.find(params[:post_id])
        post.title = params[:post_title]
        post.content = params[:post_content]
        post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "4수"], ["content", "444수"], ["updated_at", "2020-08-26 06:49:11.643185"], ["id", 44]]

    def destroy
        # 아이디을 받아서 그것을 Post내에서 찾는다
        Post.find(params[:post_id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 40]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]